Австралия/src/Documents/ReconciliationStatement/ReconciliationStatement.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ReconciliationStatement</name>
  <posting>Deny</posting>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Counterparty</name>
    <type>
      <types>CatalogRef.Counterparties</types>
    </type>
  </attributes>
  <attributes>
    <name>BeginOfPeriod</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>EndOfPeriod</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Status</name>
    <type>
      <types>EnumRef.ReconciliationStatementStatus</types>
    </type>
  </attributes>
  <attributes>
    <name>Responsible</name>
    <type>
      <types>CatalogRef.Employees</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>CounterpartyRepresentative</name>
    <type>
      <types>CatalogRef.ContactPersons</types>
    </type>
  </attributes>
  <attributes>
    <name>DocumentCurrency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </attributes>
  <attributes>
    <name>DescriptionContractsSelection</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>BalanceBeginPeriod</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Author</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>DocumentDescription</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Contract</name>
    <type>
      <types>CatalogRef.CounterpartyContracts</types>
    </type>
  </attributes>
  <attributes>
    <name>CompanyVATNumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>CompanyData</name>
    <attributes>
      <name>DocumentDate</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>DocumentNumber</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>11</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>AccountingDocument</name>
      <type>
        <types>DocumentRef.SalesInvoice</types>
        <types>DocumentRef.AccountSalesFromConsignee</types>
        <types>DocumentRef.SupplierInvoice</types>
        <types>DocumentRef.PaymentExpense</types>
        <types>DocumentRef.OtherExpenses</types>
        <types>DocumentRef.DebitNote</types>
        <types>DocumentRef.ExpenseReport</types>
        <types>DocumentRef.CashReceipt</types>
        <types>DocumentRef.SalesOrder</types>
        <types>DocumentRef.ProductionOrder</types>
        <types>DocumentRef.CreditNote</types>
        <types>DocumentRef.AccountSalesToConsignor</types>
        <types>DocumentRef.CashVoucher</types>
        <types>DocumentRef.ArApAdjustments</types>
        <types>DocumentRef.PaymentReceipt</types>
        <types>DocumentRef.OpeningBalanceEntry</types>
        <types>DocumentRef.AdditionalExpenses</types>
      </type>
    </attributes>
    <attributes>
      <name>DocumentDescription</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>CompanyDebtAmount</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ClientDebtAmount</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CounterpartyData</name>
    <attributes>
      <name>IncomingDocumentDate</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>IncomingDocumentNumber</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>AccountingDocument</name>
      <type>
        <types>DocumentRef.SalesInvoice</types>
        <types>DocumentRef.AccountSalesFromConsignee</types>
        <types>DocumentRef.SupplierInvoice</types>
        <types>DocumentRef.PaymentExpense</types>
        <types>DocumentRef.OtherExpenses</types>
        <types>DocumentRef.DebitNote</types>
        <types>DocumentRef.ExpenseReport</types>
        <types>DocumentRef.CashReceipt</types>
        <types>DocumentRef.SalesOrder</types>
        <types>DocumentRef.ProductionOrder</types>
        <types>DocumentRef.CreditNote</types>
        <types>DocumentRef.AccountSalesToConsignor</types>
        <types>DocumentRef.CashVoucher</types>
        <types>DocumentRef.ArApAdjustments</types>
        <types>DocumentRef.PaymentReceipt</types>
        <types>DocumentRef.OpeningBalanceEntry</types>
        <types>DocumentRef.AdditionalExpenses</types>
      </type>
    </attributes>
    <attributes>
      <name>DocumentDescription</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>CompanyDebtAmount</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ClientDebtAmount</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AdditionalAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AdditionalAttributesAndInfo</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AdditionalAttributesAndInfo</types>
      </type>
    </attributes>
    <attributes>
      <name>TextString</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Австралия/src/Documents/ReconciliationStatement/Forms/ListFormForExternalUsers/Module.bsl
#Region FormEventHandlers

&AtServer
Procedure FormManagment()
	Items.BusinessProcessJobCreateBasedOn.Visible = GetFunctionalOption("UseSupportForExternalUsers");
EndProcedure

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	FillPropertyValues(ThisObject, ExternalUsers.ExternalUserAuthorizationData());
	CommonClientServer.SetDynamicListParameter(List, "Counterparty", AuthorizedCounterparty);
	CommonClientServer.SetDynamicListParameter(List, "UseContractRestrictionsTurnOff",
		Not GetFunctionalOption("UseContractRestrictionsForExternalUsers"));
	
EndProcedure

&AtClient
Procedure OnOpen(Cancel)
	FormManagment();
EndProcedure

#EndRegion

#Region FormHeaderItemsEventHandlers

&AtClient
Procedure StatusFilterOnChange(Item)
	
	DriveClientServer.SetListFilterItem(List, "Status", Status, ValueIsFilled(Status));
	
EndProcedure

&AtClient
Procedure CompanyFilterOnChange(Item)
	
	DriveClientServer.SetListFilterItem(List, "Company", Company, ValueIsFilled(Company));
	
EndProcedure

#EndRegion

#Region FormTableItemsEventHandlersList

&AtClient
Procedure ListSelection(Item, SelectedRow, Field, StandardProcessing)
	StandardProcessing = False;
	
	GeneratePrintFormReconciliationStatement();
EndProcedure

#EndRegion

#Region FormCommandsEventHandlers

&AtClient
Procedure OpenDocument(Command)
	
	GeneratePrintFormReconciliationStatement();
	
EndProcedure

#EndRegion

#Region Private

&AtClient
Procedure GeneratePrintFormReconciliationStatement()
	
	If Items.List.SelectedRows.Count() = 0 Then
		Return;
	EndIf;
	
	RefsArray = New Array;
	
	For Each Row In Items.List.SelectedRows Do
		RefsArray.Add(Row);	
	EndDo;
	
	OpenParameters = New Structure("PrintManagerName, TemplatesNames, CommandParameter, PrintParameters");
	OpenParameters.PrintManagerName = "Document.ReconciliationStatement";
	OpenParameters.TemplatesNames   = "ReconciliationStatement";
	OpenParameters.CommandParameter	 = RefsArray;
	
	PrintParameters = New Structure("FormTitle, ID, AdditionalParameters");
	PrintParameters.FormTitle = NStr("en = 'Reconciliation statement'; ru = 'Сверка взаиморасчетов';pl = 'Uzgodnienie';es_ES = 'Declaración de reconciliación';es_CO = 'Declaración de reconciliación';tr = 'Mutabakat ekstresi';it = 'Dichiarazione di riconciliazione';de = 'Saldenabgleich'");
	PrintParameters.ID = "ReconciliationStatement";
	PrintParameters.AdditionalParameters = New Structure("Result");
	OpenParameters.PrintParameters = PrintParameters;
	
	If Not PrintManagementClientDrive.DisplayPrintOption(RefsArray, OpenParameters, FormOwner, UniqueKey, OpenParameters.PrintParameters) Then
		OpenForm("CommonForm.PrintDocuments", OpenParameters, ThisObject, UniqueKey);
	EndIf;
	
EndProcedure

#EndRegion
